# Pandas Exercises

In [1]:
import pandas as pd

In [2]:
# read the banklist csv into a dataframe called banks
data_dir = '../Assets/Data-Python-for-Financial-Analysis/'
banks = pd.read_csv(data_dir + 'banklist.csv')

In [3]:
banks.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

In [4]:
# What are the column names?
banks.columns

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

In [7]:
# How many States (ST) are represented in this data set?
banks['ST'].nunique()

44

In [9]:
# Get a list or array of all the states in the data set
banks['ST'].unique()

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

In [18]:
# What are the top 5 states with the most failed banks?
banks.groupby('ST').count().sort_values(by='Bank Name',ascending=False).head()

    Bank Name  City  CERT  Acquiring Institution  Closing Date  Updated Date
ST
GA         93    93    93                     93            93            93
FL         75    75    75                     75            75            75
IL         67    67    67                     67            67            67
CA         41    41    41                     41            41            41
MN         23    23    23                     23            23            23

In [21]:
# What are the top 5 acquiring institutions?
banks.groupby('Acquiring Institution').count().sort_values(by='Bank Name',ascending=False).head()

,Bank Name,City,ST,CERT,Closing Date,Updated Date
Acquiring Institution,,,,,,
No Acquirer,31,31,31,31,31,31
State Bank and Trust Company,12,12,12,12,12,12
First-Citizens Bank & Trust Company,11,11,11,11,11,11
Ameris Bank,10,10,10,10,10,10
U.S. Bank N.A.,9,9,9,9,9,9

In [32]:
# How many banks has the State Bank of Texas acquired? 
# How many of them were actually in Texas?
banks[banks['Acquiring Institution'] == 'State Bank of Texas']

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
21,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,24-Oct-14,6-Jan-16
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12

In [34]:
banks[(banks['Acquiring Institution'] == 'State Bank of Texas') & 
      (banks['ST'] == 'TX')]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
450,Millennium State Bank of Texas,Dallas,TX,57667,State Bank of Texas,2-Jul-09,26-Oct-12